#+TITLE:Loan Prediction System
#+PROPERTY: header-args :python :tangle ./main.py :mkdirp yes

For a bank which deals with loans from customers.
It is important to for a bank to predict the next loan and use the extracted knowledge to improve their services in certain regions.

* Preprocessing

First things first, I have to turn these entries into a high-quality data so that we can train our model based on it.

#+begin_src python :tangle no
  import pandas as pd

  dataset = pd.read_csv("res/loan-dataset.csv")
  return dataset
#+end_src

#+RESULTS:
#+begin_example
      Loan_ID  Gender Married  ... Credit_History Property_Area Loan_Status
0    LP001002    Male      No  ...            1.0         Urban           Y
1    LP001003    Male     Yes  ...            1.0         Rural           N
2    LP001005    Male     Yes  ...            1.0         Urban           Y
3    LP001006    Male     Yes  ...            1.0         Urban           Y
4    LP001008    Male      No  ...            1.0         Urban           Y
..        ...     ...     ...  ...            ...           ...         ...
609  LP002978  Female      No  ...            1.0         Rural           Y
610  LP002979    Male     Yes  ...            1.0         Rural           Y
611  LP002983    Male     Yes  ...            1.0         Urban           Y
612  LP002984    Male     Yes  ...            1.0         Urban           Y
613  LP002990  Female      No  ...            0.0     Semiurban           N

[614 rows x 13 columns]
#+end_example

** Null Values

Number of Missing values

#+begin_src python
  import pandas as pd
  dataset = pd.read_csv("res/loan-dataset.csv")
  return dataset[dataset.isnull().any(axis=1)]
#+end_src

#+RESULTS:
#+begin_example
      Loan_ID  Gender Married  ... Credit_History Property_Area Loan_Status
0    LP001002    Male      No  ...            1.0         Urban           Y
11   LP001027    Male     Yes  ...            1.0         Urban           Y
16   LP001034    Male      No  ...            NaN         Urban           Y
19   LP001041    Male     Yes  ...            1.0         Urban           Y
23   LP001050     NaN     Yes  ...            0.0         Rural           N
..        ...     ...     ...  ...            ...           ...         ...
592  LP002933     NaN      No  ...            1.0     Semiurban           Y
597  LP002943    Male      No  ...            0.0     Semiurban           N
600  LP002949  Female      No  ...            NaN         Urban           N
601  LP002950    Male     Yes  ...            1.0         Rural           Y
605  LP002960    Male     Yes  ...            1.0         Urban           N

[134 rows x 13 columns]
#+end_example


Number of missing values per column

#+begin_src python
  import pandas as pd
  dataset = pd.read_csv("res/loan-dataset.csv")
  return dataset.isnull().sum()
#+end_src

#+RESULTS:
#+begin_example
Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64
#+end_example


